OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSOTG_Dual_Role_UMAS/main.c
/**************************************************************************//**
 * @file     main.c
 * @version  V1.00
 * @brief    Demonstrate how USB works as a dual role device.
 *           If it works as USB Host, it can access a mass storage device.
 *           If it works as USB Device, it acts as a mass storage device.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"
#include "usbh_lib.h"
#include "ff.h"
#include "diskio.h"
#include "massstorage.h"

uint8_t g_bIsBdevice = 0, g_bIsAdevice = 0;
extern uint8_t volatile g_u8MscStart;

/* HSOTG interrupt handler */
NVT_ITCM void HSOTG_IRQHandler(void)
{
    __IO uint32_t u32INTSTS, u32INTEN;

    u32INTEN = HSOTG->INTEN;
    u32INTSTS = HSOTG->INTSTS;

    if (u32INTSTS & u32INTEN & HSOTG_INTSTS_IDCHGIF_Msk)
    {
        printf("[ID changed]\n");

        /* Check ID status */
        if (HSOTG_GET_STATUS(HSOTG_STATUS_IDSTS_Msk))
            g_bIsAdevice = 0;

        /* Clear ID status changed interrupt flag */
        HSOTG_CLR_INT_FLAG(HSOTG_INTSTS_IDCHGIF_Msk);
    }

    if (u32INTSTS & u32INTEN & HSOTG_INTSTS_BVLDCHGIF_Msk)
    {
        printf("[B session valid (HSOTG_STATUS: 0x%x)]\n", HSOTG->STATUS);

        /* Check ID status */
        if (HSOTG_GET_STATUS(HSOTG_STATUS_IDSTS_Msk) == 0)
            g_bIsBdevice = 0;

        /* Clear B-device session valid state change interrupt flag */
        HSOTG_CLR_INT_FLAG(HSOTG_INTSTS_BVLDCHGIF_Msk);
    }

    /* Clear all interrupt flags */
    HSOTG->INTSTS = u32INTSTS;
    /* make sure that interrupt flag has been cleared. */
    u32INTSTS = HSOTG->INTSTS;
}


#define BUFF_SIZE       (2048)

static UINT blen = BUFF_SIZE;
DWORD       acc_size;
WORD        acc_files, acc_dirs;
FILINFO     Finfo;
static FIL  file1, file2;                   /* File objects                               */

char        Line[256];                      /* Console input buffer                       */
#if _USE_LFN
    char        Lfname[512];                    /* Console input buffer                       */
#endif

#ifdef __ICCARM__
    #pragma data_alignment=32
    BYTE        Buff_Pool1[BUFF_SIZE] ;         /* Working buffer 1                           */
    BYTE        Buff_Pool2[BUFF_SIZE] ;         /* Working buffer 2                           */
#else
    BYTE Buff_Pool1[BUFF_SIZE] __attribute__((aligned(32)));    /* Working buffer 1                           */
    BYTE Buff_Pool2[BUFF_SIZE] __attribute__((aligned(32)));    /* Working buffer 2                           */
#endif

BYTE  *Buff1;
BYTE  *Buff2;

volatile uint32_t  g_tick_cnt;

NVT_ITCM void SysTick_Handler(void)
{
    g_tick_cnt++;
}

void enable_sys_tick(int ticks_per_second)
{
    g_tick_cnt = 0;

    if (SysTick_Config(SystemCoreClock / ticks_per_second))
    {
        /* Setup SysTick Timer for 1 second interrupts  */
        printf("Set system tick error!!\n");

        while (1);
    }
}

uint32_t get_ticks()
{
    return g_tick_cnt;
}


/*
 *  This function is necessary for USB Host library.
 */
void delay_us(int usec)
{
    /*
     *  Configure Timer0, clock source from HIRC_12M. Prescale 12
     */
    /* TIMER0 clock from HIRC */
    CLK_SetModuleClock(TMR0_MODULE, CLK_TMRSEL_TMR0SEL_HIRC, 0);
    CLK_EnableModuleClock(TMR0_MODULE);

    TIMER_SET_PRESCALE_VALUE(TIMER0, (12 - 1));
    /* stop timer0 */
    TIMER_Stop(TIMER0);
    /* write 1 to clear for safety */
    TIMER_ClearIntFlag(TIMER0);
    TIMER_ClearWakeupFlag(TIMER0);
    /* set timer cmp value */
    TIMER_SET_CMP_VALUE(TIMER0, usec);
    /* Timer0 config to oneshot mode */
    TIMER_SET_OPMODE(TIMER0, TIMER_ONESHOT_MODE);
    /* start timer0*/
    TIMER_Start(TIMER0);

    while (TIMER_GetIntFlag(TIMER0) == 0);
}

void  dump_buff_hex(uint8_t *pucBuff, int nBytes)
{
    int     nIdx, i;

    nIdx = 0;

    while (nBytes > 0)
    {
        printf("0x%04X  ", nIdx);

        for (i = 0; i < 16; i++)
            printf("%02x ", pucBuff[nIdx + i]);

        printf("  ");

        for (i = 0; i < 16; i++)
        {
            if ((pucBuff[nIdx + i] >= 0x20) && (pucBuff[nIdx + i] < 127))
                printf("%c", pucBuff[nIdx + i]);
            else
                printf(".");

            nBytes--;
        }

        nIdx += 16;
        printf("\n");
    }

    printf("\n");
}


/*----------------------------------------------*/
/* Get a value of the string                    */
/*----------------------------------------------*/
/*  "123 -5   0x3ff 0b1111 0377  w "
        ^                           1st call returns 123 and next ptr
           ^                        2nd call returns -5 and next ptr
                   ^                3rd call returns 1023 and next ptr
                          ^         4th call returns 15 and next ptr
                               ^    5th call returns 255 and next ptr
                                  ^ 6th call fails and returns 0
*/

int xatoi(          /* 0:Failed, 1:Successful */
    TCHAR **str,    /* Pointer to pointer to the string */
    long *res       /* Pointer to a variable to store the value */
)
{
    unsigned long val;
    unsigned char r, s = 0;
    TCHAR c;


    *res = 0;

    while ((c = **str) == ' ')(*str)++;     /* Skip leading spaces */

    if (c == '-')       /* negative? */
    {
        s = 1;
        c = *(++(*str));
    }

    if (c == '0')
    {
        c = *(++(*str));

        switch (c)
        {
            case 'x':       /* hexadecimal */
                r = 16;
                c = *(++(*str));
                break;

            case 'b':       /* binary */
                r = 2;
                c = *(++(*str));
                break;

            default:
                if (c <= ' ') return 1; /* single zero */

                if (c < '0' || c > '9') return 0;   /* invalid char */

                r = 8;      /* octal */
        }
    }
    else
    {
        if (c < '0' || c > '9') return 0;   /* EOL or invalid char */

