OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSOTG_Dual_Role_UMAS/main.c
    /* HSUSB_VBUS_EN (USB 2.0 VBUS power enable pin) multi-function pin - PB.10   */
    SET_HSUSB_VBUS_EN_PJ13();

    /* HSUSB_VBUS_ST (USB 2.0 over-current detect pin) multi-function pin - PB.11 */
    SET_HSUSB_VBUS_ST_PJ12();


    /* Lock protected registers */
    SYS_LockReg();
}

void USBH_Process()
{
    char        *ptr, *ptr2;
    long        p1, p2, p3;
    BYTE        *buf;
    FATFS       *fs;              /* Pointer to file system object */
    FRESULT     res;
    TCHAR       usb_path[] = { '3', ':', 0 };    /* USB drive started from 3 */

    DIR dir;                /* Directory object */
    UINT s1, s2, cnt;
    static const BYTE ft[] = {0, 12, 16, 32};
    DWORD ofs = 0, sect = 0;
    uint32_t    t0;

    usbh_pooling_hubs();
    f_chdrive(usb_path);          /* set default path */

    for (;;)
    {

        if (!g_bIsAdevice)
        {
            printf("break-A (HSOTG_STATUS: 0x%x)\n", HSOTG->STATUS);
            return;
        }

        usbh_pooling_hubs();

        printf(_T(">"));
        ptr = Line;

        get_line(ptr, sizeof(Line));

        switch (*ptr++)
        {

            case '4' :
            case '5' :
            case '6' :
            case '7' :
                ptr--;
                *(ptr + 1) = ':';
                *(ptr + 2) = 0;
                put_rc(f_chdrive((TCHAR *)ptr));
                break;

            case 'd' :     /* d [<lba>] - Dump sector */
                if (!xatoi(&ptr, &p2)) p2 = sect;

                res = (FRESULT)disk_read(3, Buff1, p2, 1);

                if (res)
                {
                    printf("rc=%d\n", (WORD)res);
                    break;
                }

                sect = p2 + 1;
                printf("Sector:%d\n", (INT)p2);

                for (buf = (unsigned char *)Buff1, ofs = 0; ofs < 0x200; buf += 16, ofs += 16)
                    put_dump(buf, ofs, 16);

                break;

            case 'b' :
                switch (*ptr++)
                {
                    case 'd' :  /* bd <addr> - Dump R/W buffer */
                        if (!xatoi(&ptr, &p1)) break;

                        for (ptr = (char *)&Buff1[p1], ofs = p1, cnt = 32; cnt; cnt--, ptr += 16, ofs += 16)
                            put_dump((BYTE *)ptr, ofs, 16);

                        break;

                    case 'e' :  /* be <addr> [<data>] ... - Edit R/W buffer */
                        if (!xatoi(&ptr, &p1)) break;

                        if (xatoi(&ptr, &p2))
                        {
                            do
                            {
                                Buff1[p1++] = (BYTE)p2;
                            } while (xatoi(&ptr, &p2));

                            break;
                        }

                        for (;;)
                        {
                            printf("%04X %02X-", (WORD)p1, Buff1[p1]);
                            get_line(Line, sizeof(Line));
                            ptr = Line;

                            if (*ptr == '.') break;

                            if (*ptr < ' ')
                            {
                                p1++;
                                continue;
                            }

                            if (xatoi(&ptr, &p2))
                                Buff1[p1++] = (BYTE)p2;
                            else
                                printf("???\n");
                        }

                        break;

                    case 'r' :  /* br <sector> [<n>] - Read disk into R/W buffer */
                        if (!xatoi(&ptr, &p2)) break;

                        if (!xatoi(&ptr, &p3)) p3 = 1;

                        printf("rc=%d\n", disk_read(0, Buff1, p2, p3));
                        break;

                    case 'w' :  /* bw <sector> [<n>] - Write R/W buffer into disk */
                        if (!xatoi(&ptr, &p2)) break;

                        if (!xatoi(&ptr, &p3)) p3 = 1;

                        printf("rc=%d\n", disk_write(0, Buff1, p2, p3));
                        break;

                    case 'f' :  /* bf <n> - Fill working buffer */
                        if (!xatoi(&ptr, &p1)) break;

                        memset(Buff1, (int)p1, BUFF_SIZE);
                        break;

                }

                break;

            case 'f' :
                switch (*ptr++)
                {

                    case 's' :  /* fs - Show logical drive status */
                        res = f_getfree("", (DWORD *)&p2, &fs);

                        if (res)
                        {
                            put_rc(res);
                            break;
                        }

                        printf("FAT type = FAT%d\nBytes/Cluster = %d\nNumber of FATs = %d\n"
                               "Root DIR entries = %d\nSectors/FAT = %d\nNumber of clusters = %d\n"
                               "FAT start (lba) = %d\nDIR start (lba,cluster) = %d\nData start (lba) = %d\n\n...",
                               ft[fs->fs_type & 3], (INT)(fs->csize * 512UL), fs->n_fats,
                               fs->n_rootdir, (INT)fs->fsize, (INT)(fs->n_fatent - 2),
                               (INT)fs->fatbase, (INT)fs->dirbase, (INT)fs->database
                              );
                        acc_size = acc_files = acc_dirs = 0;
#if _USE_LFN
                        Finfo.lfname = Lfname;
                        Finfo.lfsize = sizeof(Lfname);
#endif
                        res = scan_files(ptr);

                        if (res)
                        {
                            put_rc(res);
                            break;
                        }

                        printf("\r%d files, %d bytes.\n%d folders.\n"
                               "%d KB total disk space.\n%d KB available.\n",
                               acc_files, (INT)acc_size, acc_dirs,
                               (INT)(fs->n_fatent - 2) * (INT)(fs->csize / 2), (INT)(p2 * (fs->csize / 2))
                              );
                        break;

                    case 'l' :  /* fl [<path>] - Directory listing */
                        while (*ptr == ' ') ptr++;

                        res = f_opendir(&dir, ptr);

