OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSOTG_Dual_Role_UMAS/main.c
                            if ((p1 % 0x10000) == 0)
                                printf("\n%d KB compared.", (INT)(p1 / 1024));

                            printf(".");
                        }

                        if (s1 == 0)
                            printf("\nPASS. \n ");

                        f_close(&file1);
                        f_close(&file2);
                        break;

#if _FS_RPATH

                    case 'g' :  /* fg <path> - Change current directory */
                        while (*ptr == ' ') ptr++;

                        put_rc(f_chdir(ptr));
                        break;

                    case 'j' :  /* fj <drive#> - Change current drive */
                        while (*ptr == ' ') ptr++;

                        dump_buff_hex((uint8_t *)&p1, 16);
                        put_rc(f_chdrive((TCHAR *)ptr));
                        break;
#endif
#if _USE_MKFS

                    case 'm' :  /* fm <partition rule> <sect/clust> - Create file system */
                        if (!xatoi(&ptr, &p2) || !xatoi(&ptr, &p3)) break;

                        printf("The memory card will be formatted. Are you sure? (Y/n)=");
                        get_line(ptr, sizeof(Line));

                        if (*ptr == 'Y')
                            put_rc(f_mkfs(0, (BYTE)p2, (WORD)p3));

                        break;
#endif

                    case 'z' :  /* fz [<rw size>] - Change R/W length for fr/fw/fx command */
                        if (xatoi(&ptr, &p1) && p1 >= 1 && (size_t)p1 <= BUFF_SIZE)
                            blen = p1;

                        printf("blen=%d\n", blen);
                        break;
                }

                break;

            case '?':       /* Show usage */
                printf(
                    _T("n: - Change default drive (USB drive is 3~7)\n")
                    _T("d [<lba>] - Dump sector\n")
                    //_T("ds <pd#> - Show disk status\n")
                    _T("\n")
                    _T("bd <ofs> - Dump working buffer\n")
                    _T("be <ofs> [<data>] ... - Edit working buffer\n")
                    _T("br <pd#> <sect> [<num>] - Read disk into working buffer\n")
                    _T("bw <pd#> <sect> [<num>] - Write working buffer into disk\n")
                    _T("bf <val> - Fill working buffer\n")
                    _T("\n")
                    _T("fs - Show volume status\n")
                    _T("fl [<path>] - Show a directory\n")
                    _T("fo <mode> <file> - Open a file\n")
                    _T("fc - Close the file\n")
                    _T("fe <ofs> - Move fp in normal seek\n")
                    //_T("fE <ofs> - Move fp in fast seek or Create link table\n")
                    _T("fd <len> - Read and dump the file\n")
                    _T("fr <len> - Read the file\n")
                    _T("fw <len> <val> - Write to the file\n")
                    _T("fn <object name> <new name> - Rename an object\n")
                    _T("fu <object name> - Unlink an object\n")
                    _T("fv - Truncate the file at current fp\n")
                    _T("fk <dir name> - Create a directory\n")
                    _T("fa <atrr> <mask> <object name> - Change object attribute\n")
                    _T("ft <year> <month> <day> <hour> <min> <sec> <object name> - Change timestamp of an object\n")
                    _T("fx <src file> <dst file> - Copy a file\n")
                    _T("fg <path> - Change current directory\n")
                    _T("fj <ld#> - Change current drive. For example: <fj 4:>\n")
                    _T("fm <ld#> <rule> <cluster size> - Create file system\n")
                    _T("\n")
                );
                break;
        }
    }
}
/*---------------------------------------------------------------------------------------------------------*/
/*  MAIN function                                                                                          */
/*---------------------------------------------------------------------------------------------------------*/
int32_t main(void)
{
    /* Unlock protected registers */
    SYS_UnlockReg();
    /* Init System, IP clock and multi-function I/O */
    SYS_Init();

    /* Init DeubgUART for printf */
    InitDebugUart();

    /* Lock protected registers */
    SYS_LockReg();

    enable_sys_tick(100);
    printf("\n\n");
    printf("system clock :%uMHz\r\n", SystemCoreClock);
    printf("+------------------------------------------------------+\n");
    printf("|                                                      |\n");
    printf("|    HSOTG ID dependent Mass Storage sample program    |\n");
    printf("|                                                      |\n");
    printf("+------------------------------------------------------+\n");

    printf("The USB role is determined by the ID pin state of USB cable.\n");
    printf("If acts as a USB host, it can access a mass storage device with a simple file system. ");
    printf("Type '?' on command line to show all supported commands.\n");
    printf("If attempts to switch the USB role as a USB device, press 'Enter' key after unplugging the USB cable to exit the file system. ");
    printf("Then plug a proper USB connector to switch the USB role as a mass storage device. The internal data flash is used as the storage.\n");

    HSOTG_ENABLE_PHY();
    /* Enable ID detection function */
    HSOTG_ENABLE_ID_DETECT();
    NVIC_EnableIRQ(HSOTG_IRQn);
    delay_us(1000);

    Buff1 = (BYTE *)((uint32_t)&Buff_Pool1[0]);
    Buff2 = (BYTE *)((uint32_t)&Buff_Pool2[0]);

    usbh_core_init();
    usbh_umas_init();

    while (1)
    {
        if (HSOTG_GET_STATUS(HSOTG_STATUS_IDSTS_Msk))  /* B-device */
        {
            if (HSOTG_GET_STATUS(HSOTG_STATUS_BVLD_Msk))  /* plug-in */
            {
                g_bIsBdevice = 1;
                printf("B-device (HSOTG_STATUS: 0x%x)\n", HSOTG->STATUS);
                HSUSBD_Open(&gsHSInfo, MSC_ClassRequest, NULL);
                MSC_Init();
                NVIC_EnableIRQ(HSUSBD_IRQn);

                /* Clear B-device session valid state change interrupt flag */
                HSOTG_CLR_INT_FLAG(HSOTG_INTSTS_BVLDCHGIF_Msk);
                /* Enable B-device session valid state change interrupt */
                HSOTG_ENABLE_INT(HSOTG_INTEN_BVLDCHGIEN_Msk);

                while (1)
                {
                    if (HSOTG_GET_STATUS(HSOTG_STATUS_BVLD_Msk) == 0)
                        break;

                    if (g_u8MscStart)
                        MSC_ProcessCmd();
                }

                /* Disable B-device session valid state change interrupt */
                HSOTG->INTEN &= ~HSOTG_INTEN_BVLDCHGIEN_Msk;
                /* Clear B-device session valid state change interrupt flag */
                HSOTG_CLR_INT_FLAG(HSOTG_INTSTS_BVLDCHGIF_Msk);
                printf("break-B (HSOTG_STATUS: 0x%x)\n", HSOTG->STATUS);
            }
        }
        else     /* A-device */
        {
            g_bIsAdevice = 1;
            printf("A-device (HSOTG_STATUS: 0x%x)\n", HSOTG->STATUS);
            /* Clear ID status changed interrupt flag */
            HSOTG_CLR_INT_FLAG(HSOTG_INTSTS_IDCHGIF_Msk);
            /* Enable ID status changed interrupt */
            HSOTG_ENABLE_INT(HSOTG_INTEN_IDCHGIEN_Msk);
            USBH_Process();
            /* Disable ID status changed interrupt */
            HSOTG_DISABLE_INT(HSOTG_INTEN_IDCHGIEN_Msk);
        }
    }
}
